# GetTextJust

## Description
Function GetTextJust returns the text justification of the referenced text object.

[[Image:textlocus.gif| left]]

{| class="wikitable_c"
|+ Table - Text Justification
! Justification !! Constant
|-
| Left
| style="text-align:center"| 1
|-
| Center
| style="text-align:center"| 2
|-
| Right
| style="text-align:center"| 3
|-
| Justify
| style="text-align:center"| 4
|}

```pascal
FUNCTION GetTextJust(TextHd : HANDLE): INTEGER;
```

```python
def vs.GetTextJust(TextHd):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|TextHd|HANDLE|Handle to text object.|

## Remarks
([[User:Orso.b.schmid|Orso]], 2012 Mai. 26): The constant 4 "Justify" is introduced by VW 2011.

## See Also
VS Functions:
* SetTextJust | SetTextJustN
* GetTextVerticalAlign | SetTextVerticalAlign

## Version
Availability: from MiniCAD 6.0

## Category
* Objects - Text